/**
 * * [ 이듬(E.UID) 블렌디드 러닝 ] 2주차 오프라인 학습
 *
 * - 배열 가지고 놀기 (반복 처리 + 배열 메서드)
 * - 참조형 데이터인 배열을 복사해 안전하게 활용하기
 * - 배열(집합) + 이벤트 핸들링
 */

/* -------------------------------------------------------------------------- */
/* 배열 가지고 놀기 (반복 처리 + 배열 메서드) : https://bit.ly/ArrayReference */

// 1. 배열 생성 (글로벌, 푸터 내비게이션 / 음료 메뉴 리스트)

// 2. 특정 배열 아이템을 변수에 할당

// 3. 배열 아이템 순환하여 Console 패널에 출력

// 4. 새로운 아이템 추가 (앞 또는 뒤 아이템)

// 5. 아이템 제거 (앞/뒤 또는 특정 순서에 위치한 아이템)

// 6. 특정 아이템의 순서 추출

// 7. 새로운 아이템을 배열의 특정 순서 위치에 추가

// 8. 배열 복사

// 9. 배열 아이템에 접근 (첫번째, 특정 순서, 마지막 번째 아이템)

// 10. 배열 → 문자 → 배열 (메서드 체이닝)

/* -------------------------------------------------------------------------- */
/* 배열(집합) + 이벤트 핸들링 */
